In [8]:
import pandas as pd
import numpy as np

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
titles = pd.read_csv('data/titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('data/cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Define a year as a "Superman year" whose films feature more Superman characters than Batman. How many years in film history have been Superman years?

In [19]:
cast['superman'] = np.where(cast['character'] == 'Superman', 1, 0)
cast['batman'] = np.where(cast['character'] == 'Batman', 1, 0)
grouped = cast.groupby('year').agg({'superman': 'sum', 'batman': 'sum'})
grouped['superman_year'] = np.where(grouped['superman'] > grouped['batman'], 1, 0)
grouped[grouped['superman_year'] == 1]

      superman  batman  superman_year
year
1948         1       0              1
1950         1       0              1
1951         2       0              1
1954         5       0              1
1955         1       0              1
1973         2       1              1
1978         2       0              1
1980         2       0              1
1983         2       0              1
1987         1       0              1
2006         1       0              1

### How many years have been "Batman years", with more Batman characters than Superman characters?

### Count the number of actor roles for each year and the number of actress roles for each year over the history of film.

### Find the difference between the number of actor roles and the number of actress roles for each year over the history of film.

### What is the proportion of roles that have been 'actor' roles for each year in the history of film.

### What is the proportion of supporting (n=2) roles that have been 'actor' roles for each year in the history of film.